from main import _main

if __name__ == '__main__':
    ## 2/3 night
    #l = ['綽號「油頭教練」的現任邁阿密熱火總裁帕特萊利,請問他執教生涯中沒有待過下列哪支球隊?', 'A.洛杉磯湖人隊', 'B.邁阿密熱火隊', 'C.紐約尼克隊', 'D.波士頓賽爾提克隊']
    #l = ['請問下列哪種人喜歡自稱「駝民」?', 'A.貝都因人', 'B.吉普賽人', 'C.羅姆人', 'D.埃及人']
    #l = ['傳統上認為一共有12對腦神經,請問下列哪組腦神經分布最廣?くくく', 'A.迷走神經', 'B.位聽神經', 'C.外展神經', 'D.滑車神經']
    #l = ['〈灌籃高手》中,哪一位球員的球衣背號不是「4號」?ル', 'A.牧紳一', 'B.花形透', 'C.魚住純', 'D.藤真健司']

    ## 2/4 noon
    #l = ['台灣某個離島因地理環境擁有貝殼沙灘,素有「威尼斯沙灘」之稱是指哪裡?', 'A.澎湖', 'B.小琉球', 'C.蘭嶼', 'D.綠島']
    #l = ['請問下列哪一部作品不是皮克斯動畫工作室的作品', 'A.神偷奶爸', 'B.玩具總動員', 'C.怪獸電力公司', 'D.天外奇蹟']
    #l = ['請問下列哪一個成語與傾國傾城意義不同', 'A.閉月羞花オ', 'B.無鹽之貌', 'C.國色天香', 'D.沉魚落雁']
    #l = ['請問梅雨的形成主要原因?', 'A.溫度升高', 'B.季節交替', 'C.季風交替', 'D.溫差過大']
    #l = ['世界上海拔最高公路位於印度，請問是下列哪條公路？', 'A. 印度公路', 'B. 印緬泰公路', 'C. 馬納利公路', 'D. 馬里蘭公路']
    #l = ['第一支電動牙刷是美國開發的,請問世界上第一支『刷毛牙刷』出自哪個國家?', 'A.中國', 'B.美國', 'c.日本', 'D.印度']
    l = ['跨年各地都會施放煙火,請問中國從那個朝代開始流行煙火表演?', 'A.明朝', 'B.唐朝', 'C.宋朝', 'D.清朝']
    _main(l)
